tests/Unit/Api/PaymentIntents/data/responses/payment_intent_created.json

{
  "payment_intent":{
    "amount":5000,
    "created_at":1517470171,
    "currency_code":"USD",
    "expires_at":1517471971,
    "gateway":"chargebee",
    "gateway_account_id":"gw___test__KyVnHuRnFcq6W1X",
    "id":"__test__KyVnJjRnFcqCP8nk__test__3YVMSacdeo21KfhgNSkDVAuCo45LBZ8zW",
    "modified_at":1578727771,
    "object":"payment_intent",
    "status":"inited"
  }
}
